package main

import "fmt"

func main() {
    x := 5 // Двоичное: 00000101

    // 5 << 1: Умножение на 2¹ (на 2)
    result1 := x << 1 // 10 (Двоичное: 00001010)
    fmt.Printf("5 << 1 = %d\n", result1) // 10

    result11 := x << 2 // 20 (Двоичное: 00010100)
    fmt.Printf("5 << 2 = %d\n", result11) // 20

    // 5 << 3: Умножение на 2³ (на 8)
    result2 := x << 3 // 40 (Двоичное: 00101000)
    fmt.Printf("5 << 3 = %d\n", result2) // 40

		y := 80 // Двоичное: 01010000

    // 80 >> 1: Деление на 2¹ (на 2)
    result3 := y >> 1 // 40 (Двоичное: 00101000)
    fmt.Printf("80 >> 1 = %d\n", result3) // 40

    result33 := y >> 2 // 20 (Двоичное: 00010100)
    fmt.Printf("80 >> 2 = %d\n", result33) // 20

    // 80 >> 4: Деление на 2⁴ (на 16)
    result4 := y >> 4 // 5 (Двоичное: 00000101)
    fmt.Printf("80 >> 4 = %d\n", result4) // 5
}